### Terraform Plan — `dev` ⚠️ Changes pending
> Triggered by @mosavani on `pull_request` · 75fde8859483d481b020e3587af3c7f9aae4969f

<details><summary>Show plan</summary>

```hcl
module.iam.google_service_account.gke_nodes: Refreshing state... [id=projects/project-ec2467ed-84cd-4898-b5b/serviceAccounts/hippo-dev-cluster-nodes@project-ec2467ed-84cd-4898-b5b.iam.gserviceaccount.com]
module.github_ci_wif["hippo-image-publisher"].google_service_account.workload: Refreshing state... [id=projects/project-ec2467ed-84cd-4898-b5b/serviceAccounts/hippo-dev-cluster-hippo-image@project-ec2467ed-84cd-4898-b5b.iam.gserviceaccount.com]
module.networking.google_compute_network.vpc: Refreshing state... [id=projects/project-ec2467ed-84cd-4898-b5b/global/networks/hippo-dev-vpc]
module.github_ci_wif["hippo-helm-publisher"].google_service_account.workload: Refreshing state... [id=projects/project-ec2467ed-84cd-4898-b5b/serviceAccounts/hippo-dev-cluster-hippo-helm-p@project-ec2467ed-84cd-4898-b5b.iam.gserviceaccount.com]
google_service_account.argocd_gar: Refreshing state... [id=projects/project-ec2467ed-84cd-4898-b5b/serviceAccounts/hippo-dev-cluster-argocd-gar@project-ec2467ed-84cd-4898-b5b.iam.gserviceaccount.com]
google_secret_manager_secret.argocd_gar_key: Refreshing state... [id=projects/project-ec2467ed-84cd-4898-b5b/secrets/hippo-dev-cluster-argocd-gar-key]
google_project_iam_member.argocd_gar_reader: Refreshing state... [id=project-ec2467ed-84cd-4898-b5b/roles/artifactregistry.reader/serviceAccount:hippo-dev-cluster-argocd-gar@project-ec2467ed-84cd-4898-b5b.iam.gserviceaccount.com]
module.iam.google_project_iam_member.gke_node_roles["roles/logging.logWriter"]: Refreshing state... [id=project-ec2467ed-84cd-4898-b5b/roles/logging.logWriter/serviceAccount:hippo-dev-cluster-nodes@project-ec2467ed-84cd-4898-b5b.iam.gserviceaccount.com]
module.iam.google_project_iam_member.gke_node_roles["roles/monitoring.metricWriter"]: Refreshing state... [id=project-ec2467ed-84cd-4898-b5b/roles/monitoring.metricWriter/serviceAccount:hippo-dev-cluster-nodes@project-ec2467ed-84cd-4898-b5b.iam.gserviceaccount.com]
module.iam.google_project_iam_member.gke_node_roles["roles/artifactregistry.reader"]: Refreshing state... [id=project-ec2467ed-84cd-4898-b5b/roles/artifactregistry.reader/serviceAccount:hippo-dev-cluster-nodes@project-ec2467ed-84cd-4898-b5b.iam.gserviceaccount.com]
module.iam.google_project_iam_member.gke_node_roles["roles/stackdriver.resourceMetadata.writer"]: Refreshing state... [id=project-ec2467ed-84cd-4898-b5b/roles/stackdriver.resourceMetadata.writer/serviceAccount:hippo-dev-cluster-nodes@project-ec2467ed-84cd-4898-b5b.iam.gserviceaccount.com]
module.iam.google_project_iam_member.gke_node_roles["roles/monitoring.viewer"]: Refreshing state... [id=project-ec2467ed-84cd-4898-b5b/roles/monitoring.viewer/serviceAccount:hippo-dev-cluster-nodes@project-ec2467ed-84cd-4898-b5b.iam.gserviceaccount.com]
module.iam.google_project_iam_member.gke_node_roles["roles/storage.objectViewer"]: Refreshing state... [id=project-ec2467ed-84cd-4898-b5b/roles/storage.objectViewer/serviceAccount:hippo-dev-cluster-nodes@project-ec2467ed-84cd-4898-b5b.iam.gserviceaccount.com]
module.github_ci_wif["hippo-image-publisher"].google_service_account_iam_member.github_actions_binding_org[0]: Refreshing state... [id=projects/project-ec2467ed-84cd-4898-b5b/serviceAccounts/hippo-dev-cluster-hippo-image@project-ec2467ed-84cd-4898-b5b.iam.gserviceaccount.com/roles/iam.workloadIdentityUser/principalSet://iam.googleapis.com/projects/68730226170/locations/global/workloadIdentityPools/github-pool/attribute.repository_owner/mosavani]
module.github_ci_wif["hippo-helm-publisher"].google_service_account_iam_member.github_actions_binding_repo[0]: Refreshing state... [id=projects/project-ec2467ed-84cd-4898-b5b/serviceAccounts/hippo-dev-cluster-hippo-helm-p@project-ec2467ed-84cd-4898-b5b.iam.gserviceaccount.com/roles/iam.workloadIdentityUser/principalSet://iam.googleapis.com/projects/68730226170/locations/global/workloadIdentityPools/github-pool/attribute.repository/mosavani/hippo_k8s-service]
module.github_ci_wif["hippo-image-publisher"].google_project_iam_member.workload_roles["roles/artifactregistry.writer"]: Refreshing state... [id=project-ec2467ed-84cd-4898-b5b/roles/artifactregistry.writer/serviceAccount:hippo-dev-cluster-hippo-image@project-ec2467ed-84cd-4898-b5b.iam.gserviceaccount.com]
module.github_ci_wif["hippo-helm-publisher"].google_project_iam_member.workload_roles["roles/artifactregistry.writer"]: Refreshing state... [id=project-ec2467ed-84cd-4898-b5b/roles/artifactregistry.writer/serviceAccount:hippo-dev-cluster-hippo-helm-p@project-ec2467ed-84cd-4898-b5b.iam.gserviceaccount.com]
module.networking.google_compute_subnetwork.primary: Refreshing state... [id=projects/project-ec2467ed-84cd-4898-b5b/regions/us-central1/subnetworks/hippo-dev-subnet]
module.networking.google_compute_router.router: Refreshing state... [id=projects/project-ec2467ed-84cd-4898-b5b/regions/us-central1/routers/hippo-dev-vpc-router]
module.networking.google_compute_router_nat.nat: Refreshing state... [id=project-ec2467ed-84cd-4898-b5b/us-central1/hippo-dev-vpc-router/hippo-dev-vpc-nat]
module.gke.google_container_cluster.primary: Refreshing state... [id=projects/project-ec2467ed-84cd-4898-b5b/locations/us-central1-a/clusters/hippo-dev-cluster]
module.gke.google_container_node_pool.pools["default-pool"]: Refreshing state... [id=projects/project-ec2467ed-84cd-4898-b5b/locations/us-central1-a/clusters/hippo-dev-cluster/nodePools/default-pool]
module.workload_identity["frontend-web"].google_service_account.workload: Refreshing state... [id=projects/project-ec2467ed-84cd-4898-b5b/serviceAccounts/hippo-dev-cluster-frontend-web@project-ec2467ed-84cd-4898-b5b.iam.gserviceaccount.com]
module.workload_identity["eso"].google_service_account.workload: Refreshing state... [id=projects/project-ec2467ed-84cd-4898-b5b/serviceAccounts/hippo-dev-cluster-eso@project-ec2467ed-84cd-4898-b5b.iam.gserviceaccount.com]
module.workload_identity["frontend-web"].google_project_iam_member.workload_roles["roles/storage.objectViewer"]: Refreshing state... [id=project-ec2467ed-84cd-4898-b5b/roles/storage.objectViewer/serviceAccount:hippo-dev-cluster-frontend-web@project-ec2467ed-84cd-4898-b5b.iam.gserviceaccount.com]
module.workload_identity["frontend-web"].google_service_account_iam_member.workload_identity_binding[0]: Refreshing state... [id=projects/project-ec2467ed-84cd-4898-b5b/serviceAccounts/hippo-dev-cluster-frontend-web@project-ec2467ed-84cd-4898-b5b.iam.gserviceaccount.com/roles/iam.workloadIdentityUser/serviceAccount:project-ec2467ed-84cd-4898-b5b.svc.id.goog[default/frontend-web]]
module.workload_identity["eso"].google_service_account_iam_member.workload_identity_binding[0]: Refreshing state... [id=projects/project-ec2467ed-84cd-4898-b5b/serviceAccounts/hippo-dev-cluster-eso@project-ec2467ed-84cd-4898-b5b.iam.gserviceaccount.com/roles/iam.workloadIdentityUser/serviceAccount:project-ec2467ed-84cd-4898-b5b.svc.id.goog[external-secrets/external-secrets]]
google_secret_manager_secret_iam_member.eso_argocd_gar_accessor: Refreshing state... [id=projects/project-ec2467ed-84cd-4898-b5b/secrets/hippo-dev-cluster-argocd-gar-key/roles/secretmanager.secretAccessor/serviceAccount:hippo-dev-cluster-eso@project-ec2467ed-84cd-4898-b5b.iam.gserviceaccount.com]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.workload_identity["argocd-repo-server"].google_project_iam_member.workload_roles["roles/artifactregistry.reader"] will be created
  + resource "google_project_iam_member" "workload_roles" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:hippo-dev-cluster-argocd-repo@project-ec2467ed-84cd-4898-b5b.iam.gserviceaccount.com"
      + project = "project-ec2467ed-84cd-4898-b5b"
      + role    = "roles/artifactregistry.reader"
    }

  # module.workload_identity["argocd-repo-server"].google_service_account.workload will be created
  + resource "google_service_account" "workload" {
      + account_id   = "hippo-dev-cluster-argocd-repo"
      + description  = "Workload Identity SA for argocd-repo-server running in argocd/argocd-repo-server"
      + disabled     = false
      + display_name = "argocd-repo-server (dev)"
      + email        = "hippo-dev-cluster-argocd-repo@project-ec2467ed-84cd-4898-b5b.iam.gserviceaccount.com"
      + id           = (known after apply)
      + member       = "serviceAccount:hippo-dev-cluster-argocd-repo@project-ec2467ed-84cd-4898-b5b.iam.gserviceaccount.com"
      + name         = (known after apply)
      + project      = "project-ec2467ed-84cd-4898-b5b"
      + unique_id    = (known after apply)
    }

  # module.workload_identity["argocd-repo-server"].google_service_account_iam_member.workload_identity_binding[0] will be created
  + resource "google_service_account_iam_member" "workload_identity_binding" {
      + etag               = (known after apply)
      + id                 = (known after apply)
      + member             = "serviceAccount:project-ec2467ed-84cd-4898-b5b.svc.id.goog[argocd/argocd-repo-server]"
      + role               = "roles/iam.workloadIdentityUser"
      + service_account_id = (known after apply)
    }

Plan: 3 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  ~ wi_k8s_annotations         = {
      + argocd-repo-server = "iam.gke.io/gcp-service-account: hippo-dev-cluster-argocd-repo@project-ec2467ed-84cd-4898-b5b.iam.gserviceaccount.com"
        # (2 unchanged attributes hidden)
    }

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

```
</details>